RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/inc/bl808_sdh.h
/**
 *  @brief SDH DMA config structure type definition
 */
typedef struct
{
    SDH_DMA_Mode_Type dmaMode; /*!< SDH DMA mode */
    //SDH_Burst_Type burstType;               /*!< SDH burst type config */
    SDH_Burst_Size_Type burstSize;         /*!< SDH DMA burst size type */
    SDH_FIFO_Threshold_Type fifoThreshold; /*!< SDH FIFO threshold */
    uint32_t *admaEntries;                 /*!< SDH ADMA table entries address */
    uint32_t maxEntries;                   /*!< SDH ADMA table entries size */
} SDH_DMA_Cfg_Type;

/**
 *  @brief SDH transfer config structure type definition
 */
typedef struct
{
    SDH_Data_Cfg_Type *dataCfg; /*!< SDH data config */
    SDH_CMD_Cfg_Type *cmdCfg;   /*!< SDH command config */
} SDH_Trans_Cfg_Type;

typedef struct SDH_Handle_Cfg_Tag SDH_Handle_Cfg_Type;

/**
 *  @brief SDH transfer callback function config structure type definition
 */
typedef struct
{
    void (*SDH_CallBack_CardInserted)(void *userData);                                                           /*!< SDH card inserted occurs when DAT3/CD pin is for card detect */
    void (*SDH_CallBack_CardRemoved)(void *userData);                                                            /*!< SDH card removed occurs */
    void (*SDH_CallBack_SdioInterrupt)(void *userData);                                                          /*!< SDH SDIO card interrupt occurs */
    void (*SDH_CallBack_BlockGap)(void *userData);                                                               /*!< SDH stopped at block gap event */
    void (*SDH_CallBack_TransferFinished)(SDH_Handle_Cfg_Type *handle, SDH_Stat_Type status, void *userData);    /*!< SDH transfer complete callback */
    void (*SDH_CMDCallBack_TransferFinished)(SDH_Handle_Cfg_Type *handle, SDH_Stat_Type status, void *userData); /*!< SDH transfer complete callback */
    void (*SDH_CallBack_ReTuning)(void *userData);                                                               /*!< SDH handle the re-tuning */
    void (*SDH_CallBack_Vendor)(void *userData);                                                                 /*!< SDH handle vendor specified interrupt callback */
} SDH_Trans_Callback_Cfg_Type;

struct SDH_Handle_Cfg_Tag {
    SDH_Data_Cfg_Type *dataCfg;           /*!< SDH data config to transfer */
    SDH_CMD_Cfg_Type *cmdCfg;             /*!< SDH command config to transfer */
    uint32_t intFlag;                     /*!< SDH interrupt flags of last transaction */
    SDH_Trans_Callback_Cfg_Type callBack; /*!< SDH callback function */
    void *userData;                       /*!< SDH parameter for transfer complete callback */
};

/*@} end of group SDH_Public_Types */

/** @defgroup  SDH_Public_Constants
 *  @{
 */

/** @defgroup  SDH_STAT_TYPE
 *  @{
 */
#define IS_SDH_STAT_TYPE(type) (((type) == SDH_STAT_SUCCESS) ||            \
                                ((type) == SDH_STAT_BUSY) ||               \
                                ((type) == SDH_STAT_INVLAID_PARA) ||       \
                                ((type) == SDH_STAT_NOT_SUPPORT) ||        \
                                ((type) == SDH_STAT_OUTOF_RANGE) ||        \
                                ((type) == SDH_STAT_PREPARE_DESC) ||       \
                                ((type) == SDH_STAT_SEND_CMD_FAIL) ||      \
                                ((type) == SDH_STAT_SEND_DATA_FAIL) ||     \
                                ((type) == SDH_STAT_RECV_DATA_FAIL) ||     \
                                ((type) == SDH_STAT_DMA_ADDR_NOT_ALIGN) || \
                                ((type) == SDH_STAT_RETUNE_REQ) ||         \
                                ((type) == SDH_STAT_TUNE_ERROR))

/** @defgroup  SDH_CAP_SUPPORT_TYPE
 *  @{
 */
#define IS_SDH_CAP_SUPPORT_TYPE(type) (((type) == SDH_CAP_SUPPORT_8BITS) ||       \
                                       ((type) == SDH_CAP_SUPPORT_ADMA2) ||       \
                                       ((type) == SDH_CAP_SUPPORT_ADMA1) ||       \
                                       ((type) == SDH_CAP_SUPPORT_HIGHSPEED) ||   \
                                       ((type) == SDH_CAP_SUPPORT_SDMA) ||        \
                                       ((type) == SDH_CAP_SUPPORT_SUS_RES) ||     \
                                       ((type) == SDH_CAP_SUPPORT_VLT33) ||       \
                                       ((type) == SDH_CAP_SUPPORT_VLT30) ||       \
                                       ((type) == SDH_CAP_SUPPORT_VLT18) ||       \
                                       ((type) == SDH_CAP_SUPPORT_SBUS_64BITS) || \
                                       ((type) == SDH_CAP_SUPPORT_ASYNC_INT) ||   \
                                       ((type) == SDH_CAP_SUPPORT_DDR50) ||       \
                                       ((type) == SDH_CAP_SUPPORT_SDR104) ||      \
                                       ((type) == SDH_CAP_SUPPORT_SDR50) ||       \
                                       ((type) == SDH_CAP_SUPPORT_DRV_TYPE_A) ||  \
                                       ((type) == SDH_CAP_SUPPORT_DRV_TYPE_C) ||  \
                                       ((type) == SDH_CAP_SUPPORT_DRV_TYPE_D) ||  \
                                       ((type) == SDH_CAP_SUPPORT_SDR50_TUNE))

/** @defgroup  SDH_WAKEUP_EVENT_TYPE
 *  @{
 */
#define IS_SDH_WAKEUP_EVENT_TYPE(type) (((type) == SDH_WAKEUP_EVENT_INT) ||    \
                                        ((type) == SDH_WAKEUP_EVENT_INSERT) || \
                                        ((type) == SDH_WAKEUP_EVENT_REMOVE))

/** @defgroup  SDH_TRANS_FLAG_TYPE
 *  @{
 */
#define IS_SDH_TRANS_FLAG_TYPE(type) (((type) == SDH_TRANS_FLAG_EN_DMA) ||                \
                                      ((type) == SDH_TRANS_FLAG_EN_BLK_COUNT) ||          \
                                      ((type) == SDH_TRANS_FLAG_EN_AUTO_CMD12) ||         \
                                      ((type) == SDH_TRANS_FLAG_EN_AUTO_CMD23) ||         \
                                      ((type) == SDH_TRANS_FLAG_READ_DATA) ||             \
                                      ((type) == SDH_TRANS_FLAG_MULTI_BLK) ||             \
                                      ((type) == SDH_TRANS_FLAG_RESP_136BITS) ||          \
                                      ((type) == SDH_TRANS_FLAG_RESP_48BITS) ||           \
                                      ((type) == SDH_TRANS_FLAG_RESP_48BITS_WITH_BUSY) || \
                                      ((type) == SDH_TRANS_FLAG_EN_CRC_CHECK) ||          \
                                      ((type) == SDH_TRANS_FLAG_EN_INDEX_CHECK) ||        \
                                      ((type) == SDH_TRANS_FLAG_DATA_PRESENT) ||          \
                                      ((type) == SDH_TRANS_FLAG_SUSPEND) ||               \
                                      ((type) == SDH_TRANS_FLAG_RESUME) ||                \
                                      ((type) == SDH_TRANS_FLAG_ABORT))

/** @defgroup  SDH_PRESENT_FLAG_TYPE
 *  @{
 */
#define IS_SDH_PRESENT_FLAG_TYPE(type) (((type) == SDH_PRESENT_FLAG_CMD_INHBIT) ||       \
                                        ((type) == SDH_PRESENT_FLAG_DATA_INHBIT) ||      \
                                        ((type) == SDH_PRESENT_FLAG_DATA_LINE_ACTIVE) || \
                                        ((type) == SDH_PRESENT_FLAG_RETUNE_REQ) ||       \
                                        ((type) == SDH_PRESENT_FLAG_TX_ACTIVE) ||        \
                                        ((type) == SDH_PRESENT_FLAG_RX_ACTIVE) ||        \
                                        ((type) == SDH_PRESENT_FLAG_BUF_WRITE_ENABLE) || \
                                        ((type) == SDH_PRESENT_FLAG_BUF_READ_ENABLE) ||  \
                                        ((type) == SDH_PRESENT_FLAG_CARD_INSERT) ||      \
                                        ((type) == SDH_PRESENT_FLAG_CARD_STABLE) ||      \
                                        ((type) == SDH_PRESENT_FLAG_CARD_DET) ||         \
                                        ((type) == SDH_PRESENT_FLAG_CARD_WP) ||          \
                                        ((type) == SDH_PRESENT_FLAG_DATA0_LINE_LEVEL) || \
                                        ((type) == SDH_PRESENT_FLAG_DATA1_LINE_LEVEL) || \
                                        ((type) == SDH_PRESENT_FLAG_DATA2_LINE_LEVEL) || \
                                        ((type) == SDH_PRESENT_FLAG_DATA3_LINE_LEVEL) || \
                                        ((type) == SDH_PRESENT_FLAG_CMD_LINE_LEVEL))

