RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/inc/bl808_sdh.h
/** @defgroup  SDH_INT_TYPE
 *  @{
 */
#define IS_SDH_INT_TYPE(type) (((type) == SDH_INT_CMD_COMPLETED) ||      \
                               ((type) == SDH_INT_DATA_COMPLETED) ||     \
                               ((type) == SDH_INT_BLK_GAP_EVENT) ||      \
                               ((type) == SDH_INT_DMA_COMPLETED) ||      \
                               ((type) == SDH_INT_BUFFER_WRITE_READY) || \
                               ((type) == SDH_INT_BUFFER_READ_READY) ||  \
                               ((type) == SDH_INT_CARD_INSERT) ||        \
                               ((type) == SDH_INT_CARD_REMOVE) ||        \
                               ((type) == SDH_INT_CARD) ||               \
                               ((type) == SDH_INT_DRIVER_TA) ||          \
                               ((type) == SDH_INT_DRIVER_TB) ||          \
                               ((type) == SDH_INT_DRIVER_TC) ||          \
                               ((type) == SDH_INT_RETUNE_EVENT) ||       \
                               ((type) == SDH_INT_CMD_TIMEOUT) ||        \
                               ((type) == SDH_INT_CMD_CRC_ERROR) ||      \
                               ((type) == SDH_INT_CMD_ENDBIT_ERROR) ||   \
                               ((type) == SDH_INT_CMD_INDEX_ERROR) ||    \
                               ((type) == SDH_INT_DATA_TIMEOUT) ||       \
                               ((type) == SDH_INT_DATA_CRC_ERROR) ||     \
                               ((type) == SDH_INT_DATA_ENDBIT_ERROR) ||  \
                               ((type) == SDH_INT_CURRENT_ERROR) ||      \
                               ((type) == SDH_INT_AUTO_CMD12_ERROR) ||   \
                               ((type) == SDH_INT_DMA_ERROR) ||          \
                               ((type) == SDH_INT_TUNE_ERROR) ||         \
                               ((type) == SDH_INT_SPI_ERROR) ||          \
                               ((type) == SDH_INT_AXI_RESP_ERROR) ||     \
                               ((type) == SDH_INT_CPL_TIMEOUT_ERROR) ||  \
                               ((type) == SDH_INT_CRC_STAT_ERROR) ||     \
                               ((type) == SDH_INT_CMD_ERRORS) ||         \
                               ((type) == SDH_INT_DATA_ERRORS) ||        \
                               ((type) == SDH_INT_ALL))

/** @defgroup  SDH_BOOT_MODE_TYPE
 *  @{
 */
#define IS_SDH_BOOT_MODE_TYPE(type) (((type) == SDH_BOOT_MODE_NORMAL) || \
                                     ((type) == SDH_BOOT_MODE_ALT))

/** @defgroup  SDH_AUTO_CMD12_ERR_TYPE
 *  @{
 */
#define IS_SDH_AUTO_CMD12_ERR_TYPE(type) (((type) == SDH_AUTO_CMD12_ERR_NOT_EXE) || \
                                          ((type) == SDH_AUTO_CMD12_ERR_TIMEOUT) || \
                                          ((type) == SDH_AUTO_CMD12_ERR_ENDBIT) ||  \
                                          ((type) == SDH_AUTO_CMD12_ERR_INDEX) ||   \
                                          ((type) == SDH_AUTO_CMD12_ERR_CRC) ||     \
                                          ((type) == SDH_AUTO_CMD12_ERR_NOT_ISSUE))

/** @defgroup  SDH_ADMA_ERR_TYPE
 *  @{
 */
#define IS_SDH_ADMA_ERR_TYPE(type) (((type) == SDH_ADMA_ERR_LEN_MISMATCH) || \
                                    ((type) == SDH_ADMA_ERR_DESC_ERROR))

/** @defgroup  SDH_ADMA_ERR_STAT_TYPE
 *  @{
 */
#define IS_SDH_ADMA_ERR_STAT_TYPE(type) (((type) == SDH_ADMA_ERR_STAT_STOP_DMA) ||    \
                                         ((type) == SDH_ADMA_ERR_STAT_FETCH_DESC) ||  \
                                         ((type) == SDH_ADMA_ERR_STAT_CHANGE_ADDR) || \
                                         ((type) == SDH_ADMA_ERR_STAT_TRANS_DATA) ||  \
                                         ((type) == SDH_ADMA_ERR_STAT_INVALID_LEN) || \
                                         ((type) == SDH_ADMA_ERR_STAT_INVALID_DESC))

/** @defgroup  SDH_FORCE_EVENT_TYPE
 *  @{
 */
#define IS_SDH_FORCE_EVENT_TYPE(type) (((type) == SDH_FORCE_EVENT_AUTO_CMD12_NOT_EXE) ||     \
                                       ((type) == SDH_FORCE_EVENT_AUTO_CMD12_TIMEOUT) ||     \
                                       ((type) == SDH_FORCE_EVENT_AUTO_CMD12_CRC_ERROR) ||   \
                                       ((type) == SDH_FORCE_EVENT_AUTO_CMD12_INDEX_ERROR) || \
                                       ((type) == SDH_FORCE_EVENT_AUTO_CMD12_NOT_ISSUE) ||   \
                                       ((type) == SDH_FORCE_EVENT_ENDBIT_ERROR) ||           \
                                       ((type) == SDH_FORCE_EVENT_CMD_TIMEOUT) ||            \
                                       ((type) == SDH_FORCE_EVENT_CMD_CRC_ERROR) ||          \
                                       ((type) == SDH_FORCE_EVENT_CMD_ENDBIT_ERROR) ||       \
                                       ((type) == SDH_FORCE_EVENT_CMD_INDEX_ERROR) ||        \
                                       ((type) == SDH_FORCE_EVENT_DATA_TIMEOUT) ||           \
                                       ((type) == SDH_FORCE_EVENT_DATA_CRC_ERROR) ||         \
                                       ((type) == SDH_FORCE_EVENT_DATA_ENDBIT_ERROR) ||      \
                                       ((type) == SDH_FORCE_EVENT_DATA_INDEX_ERROR) ||       \
                                       ((type) == SDH_FORCE_EVENT_AUTO_CMD12_ERROR) ||       \
                                       ((type) == SDH_FORCE_EVENT_CARD_INT) ||               \
                                       ((type) == SDH_FORCE_EVENT_DMA_ERROR))

/** @defgroup  SDH_SPEED_MODE_TYPE
 *  @{
 */
#define IS_SDH_SPEED_MODE_TYPE(type) (((type) == SDH_SPEED_MODE_SDR12) ||  \
                                      ((type) == SDH_SPEED_MODE_SDR25) ||  \
                                      ((type) == SDH_SPEED_MODE_SDR50) ||  \
                                      ((type) == SDH_SPEED_MODE_SDR104) || \
                                      ((type) == SDH_SPEED_MODE_DDR50))

/** @defgroup  SDH_DATA_BUS_WIDTH_TYPE
 *  @{
 */
#define IS_SDH_DATA_BUS_WIDTH_TYPE(type) (((type) == SDH_DATA_BUS_WIDTH_1BIT) ||  \
                                          ((type) == SDH_DATA_BUS_WIDTH_4BITS) || \
                                          ((type) == SDH_DATA_BUS_WIDTH_8BITS))

/** @defgroup  SDH_VOLTAGE_TYPE
 *  @{
 */
#define IS_SDH_VOLTAGE_TYPE(type) (((type) == SDH_VOLTAGE_3P3V) || \
                                   ((type) == SDH_VOLTAGE_3P0V) || \
                                   ((type) == SDH_VOLTAGE_1P8V))

/** @defgroup  SDH_DMA_MODE_TYPE
 *  @{
 */
#define IS_SDH_DMA_MODE_TYPE(type) (((type) == SDH_DMA_MODE_SIMPLE) || \
                                    ((type) == SDH_DMA_MODE_ADMA1) ||  \
                                    ((type) == SDH_DMA_MODE_ADMA2))

/** @defgroup  SDH_CTRL_FLAG_TYPE
 *  @{
 */
#define IS_SDH_CTRL_FLAG_TYPE(type) (((type) == SDH_CTRL_FLAG_STOP_AT_BLK_GAP) ||         \
                                     ((type) == SDH_CTRL_FLAG_READ_WAIT) ||               \
                                     ((type) == SDH_CTRL_FLAG_INT_AT_BLK_GAP) ||          \
                                     ((type) == SDH_CTRL_FLAG_RAED_DONE_WITHOUT_8CLKS) || \
                                     ((type) == SDH_CTRL_FLAG_EXACT_BLK_NUM_READ))

/** @defgroup  SDH_CMD_TYPE
 *  @{
 */
#define IS_SDH_CMD_TYPE(type) (((type) == SDH_CMD_NORMAL) ||  \
                               ((type) == SDH_CMD_SUSPEND) || \
                               ((type) == SDH_CMD_RESUME) ||  \
                               ((type) == SDH_CMD_ABORT) ||   \
                               ((type) == SDH_CMD_EMPTY))

/** @defgroup  SDH_RESP_TYPE
 *  @{
 */
#define IS_SDH_RESP_TYPE(type) (((type) == SDH_RESP_NONE) || \
                                ((type) == SDH_RESP_R1) ||   \
                                ((type) == SDH_RESP_R1B) ||  \
                                ((type) == SDH_RESP_R2) ||   \
                                ((type) == SDH_RESP_R3) ||   \
                                ((type) == SDH_RESP_R4) ||   \
                                ((type) == SDH_RESP_R5) ||   \
                                ((type) == SDH_RESP_R5B) ||  \
                                ((type) == SDH_RESP_R6) ||   \
                                ((type) == SDH_RESP_R7))

